# BigDataSchool.in

####  Sri Sreedhar

In [1]:
import pandas as pd

In [2]:
from pandas import Series,DataFrame

In [3]:
# python -> list
# numpy -> Arrray
# pandas -> Series

In [4]:
myseries=Series([4,5,2,9])

In [5]:
myseries

0    4
1    5
2    2
3    9
dtype: int64

In [6]:
names=["maths","science","social","english"]

In [7]:
myseries=Series([4,5,2,9],index=names)

In [8]:
myseries

maths      4
science    5
social     2
english    9
dtype: int64

In [9]:
myseries['english']

9

In [10]:
maths in myseries

NameError: name 'maths' is not defined

In [11]:
'maths' in myseries

True

In [12]:
2 in myseries

False

In [13]:
myseries

maths      4
science    5
social     2
english    9
dtype: int64

In [14]:
myseries['telugu']=10

In [15]:
myseries

maths       4
science     5
social      2
english     9
telugu     10
dtype: int64

In [16]:
sample={
    'english':"Hollywood",
    'hindi':'Bollywood',
    'telugu':"tollywood"
}

In [17]:
sample

{'english': 'Hollywood', 'hindi': 'Bollywood', 'telugu': 'tollywood'}

In [18]:
myseries2=Series(sample)

In [19]:
myseries2

english    Hollywood
hindi      Bollywood
telugu     tollywood
dtype: object

In [20]:
# dict -> Series
# Dictionaries -> DataFrame

In [21]:
employee={
    'id':[1,2,3,4],
    'name':['one','two','three','four'],
    'role':['IC','IC','TM','GM']
}

In [22]:
employee

{'id': [1, 2, 3, 4],
 'name': ['one', 'two', 'three', 'four'],
 'role': ['IC', 'IC', 'TM', 'GM']}

In [23]:
# create a DataFrame from a Dict

In [24]:
df=pd.DataFrame(employee)

In [25]:
df

   id   name role
0   1    one   IC
1   2    two   IC
2   3  three   TM
3   4   four   GM

In [26]:
# accessing colmns

In [27]:
df['name']

0      one
1      two
2    three
3     four
Name: name, dtype: object

In [28]:
df['role']

0    IC
1    IC
2    TM
3    GM
Name: role, dtype: object

In [29]:
df.role

0    IC
1    IC
2    TM
3    GM
Name: role, dtype: object

In [30]:
df.name

0      one
1      two
2    three
3     four
Name: name, dtype: object

In [31]:
df['role']

0    IC
1    IC
2    TM
3    GM
Name: role, dtype: object

In [32]:
employee

{'id': [1, 2, 3, 4],
 'name': ['one', 'two', 'three', 'four'],
 'role': ['IC', 'IC', 'TM', 'GM']}

In [33]:
employee['role']

['IC', 'IC', 'TM', 'GM']

In [34]:
employee['role'][3]

'GM'

In [35]:
df['role'][3]

'GM'

In [36]:
df

   id   name role
0   1    one   IC
1   2    two   IC
2   3  three   TM
3   4   four   GM

In [37]:
# boolean selection
# npa=np.array([1,2,3,4,3,6,1,9,3,7])
# npa[npa>6]

In [38]:
df[df.role=='IC']

   id name role
0   1  one   IC
1   2  two   IC

In [39]:
df[df.role=='GM']

   id  name role
3   4  four   GM

In [40]:
df

   id   name role
0   1    one   IC
1   2    two   IC
2   3  three   TM
3   4   four   GM

In [41]:
# lets add dept

In [42]:
df['dept']=['HR','Finance','Ops','SW']

In [43]:
df

   id   name role     dept
0   1    one   IC       HR
1   2    two   IC  Finance
2   3  three   TM      Ops
3   4   four   GM       SW

In [44]:
df.head()

   id   name role     dept
0   1    one   IC       HR
1   2    two   IC  Finance
2   3  three   TM      Ops
3   4   four   GM       SW

In [45]:
df.tail()

   id   name role     dept
0   1    one   IC       HR
1   2    two   IC  Finance
2   3  three   TM      Ops
3   4   four   GM       SW

In [46]:
names=['Jon','Mathew','Sara','Ashley','Sam']
ids=[23,34,84,86,12]
sales=[10.2,83.4,72.9,21.7,222.11]
department=['A','A','B','B','B']

In [47]:
users=pd.DataFrame({'id':ids,
    'name':names,
    'sales':sales,
    'dept':department
    })

In [48]:
users

   id    name   sales dept
0  23     Jon   10.20    A
1  34  Mathew   83.40    A
2  84    Sara   72.90    B
3  86  Ashley   21.70    B
4  12     Sam  222.11    B

In [49]:
# rearrange the cols
users=users.reindex(columns=['name','sales','dept','id'])

In [50]:
users

     name   sales dept  id
0     Jon   10.20    A  23
1  Mathew   83.40    A  34
2    Sara   72.90    B  84
3  Ashley   21.70    B  86
4     Sam  222.11    B  12

In [51]:
# creating subset

In [52]:
dept_sales=users[['dept','sales']]
print(dept_sales)

  dept   sales
0    A   10.20
1    A   83.40
2    B   72.90
3    B   21.70
4    B  222.11

In [53]:
dept_sales

  dept   sales
0    A   10.20
1    A   83.40
2    B   72.90
3    B   21.70
4    B  222.11

In [54]:
groupby_dept_sales=dept_sales.groupby('dept')

In [55]:
groupby_dept_sales

In [56]:
# groupby always takes an aggregation

In [57]:
groupby_dept_sales.sum()

       sales
dept
A      93.60
B     316.71

In [58]:
# aggregation methods

In [59]:
# sum, count,max,min,mean,median,std,var

In [60]:
groupby_dept_sales.agg(['sum','count','mean','median','min','max','std','var'])

       sales
         sum count    mean median   min     max         std         var
dept
A      93.60     2   46.80   46.8  10.2   83.40   51.760216   2679.1200
B     316.71     3  105.57   72.9  21.7  222.11  104.122710  10841.5387